Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་པད་མ་དཀར་པོ་ལྟ་བུ་རྣམས་ཞེས་བྱའི་མེ་ཏོག་ལྟ་བུ་རྣམས་ཞེས་མི་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཞེས་ཀྱང་བྱའོ།
en: Thereby those bodhisattvas are said to be like the white lotus and not like flowers; those bodhisattvas are said to be mahāsattvas.

source: །བྲམ་ཟེ་འདི་ལྟ་སྟེ་དཔེར་ན་ཁྱོད་ནི་ད་ལྟར་སྨོན་ལམ་གྱི་དབང་གིས་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་བྱང་ཆུབ་སེམས་དཔའ་དཔག་ཏུ་མེད་གྲངས་མེད་པ་རྣམས་ཀྱི་ནང་དུ་དགེ་བ་ལུང་བསྟན་པའི་ཞིང་དུ་སྙིང་རྗེ་པད་མ་དཀར་པོ་ལྟ་བུར་སྐྱེས་པ་ཡིན་ནོ། །གང་གི་ཚེ་ཁྱོད་ཀྱིས་སྙིང་རྗེ་ཆེན་པོ་བརྗོད་པས་མཚམས་མེད་པ་བྱེད་པ་དང་།
en: An example of this is you, brahmin, who now amid countless, innumerable bodhisattvas have received an excellent prophecy in front of a tathāgata; you have appeared as a white lotus of compassion because of the power of your prayer. “ ‘

source: མི་དགེ་བའི་རྩ་བ་དང་ལྡན་པར་གྱུར་པའི་བར་གྱི་འདུལ་བ་རྣམས་ཡོངས་སུ་བཟུང་ཞིང་སྙིགས་མ་ལྔ་བདོ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་བཟུང་བའི་ཚེ། ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་གིས་ཀྱང་སྐྱེས་བུ་དམ་པ་ཁྱོད་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། ཕོ་ཉ་དག་ཀྱང་བཏང་ནས་ཁྱོད་ཀྱི་མིང་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཞེས་བྱ་བར་བཏགས་སོ།
en: When you spoke with great compassion, choosing as your disciples those who have committed the bad actions with immediate results at death, and so on, up to and including those who engaged in bad roots, and when you chose a buddha realm in which the five degeneracies are strong, the bhagavat buddhas in the ten directions, as numerous as the number of particles in a buddha realm, congratulated you, worthy being, and sent emissaries to you and gave you the name Mahākāruṇika.

source: །འཁོར་འདི་དག་ཐམས་ཅད་ཀྱང་ཁྱོད་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་བརྩོན་པར་གྱུར་ཏོ།
en: This entire assembly engaged in making offerings to you. “ ‘

source: །སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཅིག་འདས་ནས་ལྷག་མ་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལ་བབ་པ་ན་བསྐལ་པ་བཟང་པོ་ལ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཉི་ཤུ་ཐུབ་ཅིང་། རྒ་བ་དང་། འཆི་བ་མང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་འཇིག་རྟེན་ལྡོངས་པ། འདྲེན་པ་མེད་པ། མི་དགེ་བའི་རྩ་བ་དང་ལྡན་པར་གྱུར་ཅིང་། སེམས་ཅན་ལམ་ངན་པས་བཅོམ་པ། ཉམ་ང་བ་ཆེན་པོ་ཐོབ་པ། མཚམས་མེད་པ་བྱེད་པ། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ། དམ་པའི་ཆོས་སྤོང་བ། ལྟུང་བའི་རྩ་བ་འབྱུང་བ་ནས་ཇི་སྐད་སྔར་སྨོས་པའི་བར་དག་ལྟ་བུས་གང་བའི་འཇིག་རྟེན་དུ་དེ་བཞིན་གཤེགས་པ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་ཏེ། འགྲོ་བའི་འཁོར་ལོ་ནི་བཟློག །ཆོས་ཀྱི་འཁོར་ལོ་ནི་བསྐོར། དབང་སྒྱུར་བའི་བདུད་དང་།
en: You, Mahākāruṇika—after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River; in the great Bhadraka eon; in the Sahā realm, when the lifespan of beings is 120 years; in a buddha realm with much old age, death, and so forth; in a world of darkness; in a world filled with beings without a guide, who have not planted good roots, who are lost on a bad path, who are in great despair, who have committed the acts with immediate results at death, who malign the noble ones, who reject the good Dharma, who have committed the root downfalls, and so on, as previously described—will be a tathāgata who has wisdom and virtuous conduct, and so on, up to and including a buddha bhagavat, who has reversed the wheel of existence, who has turned the wheel of the Dharma, who has repelled the māra of power and the māra of kleśas, whose fame will resound through the endless, infinite buddha realms in the ten directions, and around whom there will be a great gathering of disciples, that is, of 1,250 bhikṣus.

source: ཉོན་མོངས་པའི་བདུད་ནི་བཅིལ་ཏེ། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་མུ་མེད་པ་དག་ཏུ་སྒྲས་ཁྱབ་པར་བྱས་ནས། ཁྱོད་ཀྱི་ཉན་ཐོས་འདུས་པ་ཆེན་པོ་དག་འབྱུང་བར་འགྱུར་བ་འདི་ལྟ་སྟེ། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུ་དང་ལྷན་ཅིག་སྨོན་ལམ་ཇི་ལྟར་བཏབ་པ་དེ་བཞིན་དུ། ལོ་བཞི་བཅུ་རྩ་ལྔར་རིམ་གྱིས་སངས་རྒྱས་ཀྱི་མཛད་པ་དེ་ལྟ་བུ་མཐའ་དག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: And just as you prayed, you will completely accomplish such all-encompassing activity of a buddha during a period of forty-five years. “ ‘

source: །དེའི་ཚེ་ན་ཇི་ལྟར་རྒྱལ་པོ་ཆེན་པོ་བདུད་རྩི་དག་པ་འདི་འོད་དཔག་མེད་ཅེས་བྱ་བར་འགྱུར་ཞིང་བསྐལ་པ་ཚད་མེད་པ་དག་གིས་སངས་རྒྱས་ཀྱི་མཛད་པ་མཐའ་དག་བྱེད་པར་འགྱུར་བ་དེ་བཞིན་དུ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཁྱོད་ཀྱང་བསྐལ་པ་ཆེན་པོ་བཟང་པོ་ལ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར་སྐྱེ་དགུ་ཚེ་ལོ་བརྒྱ་ཉི་ཤུ་ཐུབ་པ་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་ཏེ། ལོ་བཞི་བཅུ་རྩ་ལྔས་སངས་རྒྱས་ཀྱི་མཛད་པ་དེ་ལྟ་བུ་མང་པོ་དག་བྱེད་པར་འགྱུར་རོ།
en: Just as this great king Amṛtaśuddha will become Amitābha and accomplish the activity of a buddha over countless eons, at that time, Mahākāruṇika, in the great Bhadraka eon, in the Sahā realm, when the lifespan of beings is 120 years, you will be a tathāgata named Śākyamuni and in forty-five years will accomplish such complete activity of a buddha.

source: །སྐྱེས་བུ་དམ་པ་ཁྱོད་བླ་ན་མེད་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་དམ་པའི་ཆོས་ལོ་སྟོང་ལྷག་པར་གནས་པར་གྱུར་ཏོ།
en: Worthy being, when you have passed into the highest parinirvāṇa, your good Dharma will remain for a thousand years.

source: །སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱི་དམ་པའི་ཆོས་ནུབ་ནས་ཀྱང་ལུས་ལས་སྐྱེས་པའི་སྐུ་གདུང་རྣམས་ཀྱང་རང་གིས་སྨོན་ལམ་ཇི་ལྟར་བཏབ་པ་དེ་ལྟར་སངས་རྒྱས་ཀྱི་མཛད་པ་མང་པོ་མཐའ་དག་བྱེད་པར་འགྱུར་ཏེ།
en: Worthy being, when your good Dharma has come to an end, the relics from your body will, just as you have prayed, accomplish such manifold activity of a buddha.

source: སྔར་ཇི་སྐད་སྨོས་པ་དེ་བཞིན་དུ་ཡུན་རིང་པོར་སེམས་ཅན་རྣམས་འདུལ་བར་འགྱུར་རོ།
en: Just as you yourself have prayed, you will thus guide beings for a long time, as previously described.’ “

source: །རིགས་ཀྱི་བུ་དེའི་ཚེ་ན་གནས་གྲོང་ཞེས་བྱ་བ་ན་བྲམ་ཟེ་ཞིག་ཡོད་པ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྐྱེས་བུ་དམ་པ་ཁྱོད་བསྐལ་པ་གྲངས་མེད་པ་དེ་དང་དེ་དག་ཏུ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་ཀྱང་རྟག་ཏུ་བསྙེན་བཀུར་བར་འགྱུར་ཞིང་། བྱམས་པ་དང་འཐུན་པའི་ཡོ་བྱད་སྦྱོར་བ་དང་། གྲོགས་བྱེད་པར་གྱུར་ནས་ཁྱོད་ལ་བསྙེན་བཀུར་བྱེད་པར་གྱུར་ཅིག །
en: Noble son, at that time Brahmā Ketapuri said, ‘Worthy being, while you perform bodhisattva conduct throughout countless eons, may I attend upon you as a permanent attendant, as an assistant who is kindly at your service.

source: ཁྱོད་སྲིད་པ་ཐ་མ་པར་གྱུར་པ་ན་བདག་ཁྱོད་ཀྱི་ཕར་གྱུར་ཅིག །
en: When you are in your last life, may I be your father.

source: སྐྱེས་བུ་དམ་པ་བདག་ཁྱོད་ཀྱིས་བྱང་ཆུབ་ཐོབ་པའི་སྦྱིན་བདག་གི་མཆོག་ཏུ་འགྱུར་ཞིང་ཁྱོད་ཀྱིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་གྱུར་ཅིག །
en: Worthy being, when you have attained enlightenment, may I be your supreme patron, and may you give me the prophecy of my attainment of the highest, most complete enlightenment.’ “

source: གཞན་ཡང་དེ་ན་རྒྱ་མཚོའི་ལྷ་མོ་ཤིན་ཏུ་དུལ་བའི་བློ་ཞེས་བྱ་བ་དེས་ཀྱང་སྨྲས་པ། བསྐལ་པ་གྲངས་མེད་པ་དེ་དང་དེ་དག་ཅེས་བྱ་བ་ནས་ཁྱོད་སྲིད་པ་ཐ་མ་པའི་བར་དུ་གྱུར་པ་ན་བདག་ཁྱོད་སྐྱེད་པའི་མར་གྱུར་ཅིག །
en: Also at that time there was a sea goddess named Vinītabuddhi who said, ‘While you perform bodhisattva conduct throughout countless eons, and so on, up to and including when you are in your last life, may I be your mother.

source: སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་ཐོབ་ནས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་གྱུར་ཅིག །
en: Mahākāruṇika, when you have attained enlightenment, may you give me the prophecy of my attainment of the highest, most complete enlightenment.’ “

source: རྒྱུ་སྐར་གྱི་ལྷ་མོ་ཆུ་ལྷ་སྤྱོད་ཅེས་བྱ་བ་དེས་ཀྱང་སྨྲས་པ། དེ་དང་དེ་དག་ཅེས་བྱ་བ་ནས་ཁྱོད་སྲིད་པ་ཐ་མ་པའི་བར་དུ་གྱུར་པ་ན་བདག་ཁྱོད་ལ་བསྣུན་པའི་མ་མ་བྱེད་པའི་མར་གྱུར་ཅིག །
en: There was a goddess named Varuṇacāritranakṣatrā who said, ‘While you perform bodhisattva conduct throughout countless eons, and so on, up to and including when you are in your last life, may I be your wet nurse.

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་ཐོབ་ནས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་གྱུར་ཅིག །བརྒྱ་བྱིན་མུ་ཁྱུད་ཅན་ཞེས་བྱ་བ་དང་།
en: Mahākāruṇika, when you have attained enlightenment, may you give me the prophecy of my attainment of the highest, most complete enlightenment.’ “

source: གཞན་ཡང་བརྒྱ་བྱིན་ཕ་རོལ་སེམས་ཤེས་བྱ་བ་དེ་གཉིས་ཀྱིས་ཀྱང་སྨྲས་པ། ཀྱེ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་བདག་ཅག་ཀྱང་དེ་དག་ཅེས་བྱ་བ་ནས། ཁྱོད་ཀྱིས་བྱང་ཆུབ་ཐོབ་པ་ཞེས་བྱ་བའི་བར་དུ་སྟེ། བདག་ཅག་ཤེས་རབ་དང་ལྡན་པ་དང་། རྫུ་འཕྲུལ་དང་ལྡན་པའི་ཉན་ཐོས་ཟུང་དུ་གྱུར་ཅིག །
en: A śakra named Sanema and another śakra named Pāracintin both said, ‘Dear Mahākāruṇika, may we too, and so on, up to and including when you have attained enlightenment, be your disciples, one with wisdom and one with miraculous powers.’ “

source: གཞན་ཡང་བརྒྱ་བྱིན་སྤྱད་སྤྱོད་ལྟ་མཛེས་ཚོགས་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་བདག་ཀྱང་ཁྱོད་དེ་དང་དེ་དག་ཅེས་བྱ་བ་ནས་སྲིད་པ་ཐ་མའི་བར་དུ་གྱུར་པའི་བུར་གྱུར་ཅིག །
en: Also, another śakra named Cāritracaraṇasudarśayūthika said, ‘Mahākāruṇika, may I, and so on, up to and including when you are in your last life, be your son.’ “

source: གཞན་ཡང་རི་རྩེའི་ལྷ་མོ་དེས་པ་ཀིང་ཤུ་ཀ་ཞེས་བྱ་བ་དེས་ཀྱང་སྨྲས་པ། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་བདག་ཀྱང་ཚེ་རབས་དེ་དང་དེ་དག་ཏུ་ཁྱོད་ཀྱི་བཙུན་མོར་གྱུར་ཅིང་། ཁྱོད་ཀྱིས་བྱང་ཆུབ་ཐོབ་ནས་བདག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་གྱུར་ཅིག །
en: Also, a mountain goddess named Saurabhyākiṃśukā said, ‘Mahākāruṇika, may I be your wife in those lifetimes, and when you have attained enlightenment, may you give me the prophecy of my attainment of the highest, most complete enlightenment.’ “

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་མཛེས་སྤྱོད་ཅེས་བྱ་བ་དེས་ཀྱང་སྨྲས་པ། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཁྱོད་བསྐལ་པ་གྲངས་མེད་པ་དེ་དང་དེ་དག་ཏུ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་ཀྱང་སྐྱེས་བུ་དམ་པ་ཁྱོད་ལ་བྱམས་པ་དང་འཐུན་པའི་ཡོ་བྱད་ཀྱིས་གྲོགས་བྱེད་པའི་བྲན་ཉིད་དུ་གྱུར་ཏེ། ཁྱོད་ལ་བསྙེན་བཀུར་བྱེད་པར་གྱུར་ཅིག །
en: Also, a lord of the asuras named Kaduścara said, ‘Mahākāruṇika, while you, worthy being, perform bodhisattva conduct throughout countless eons, may I attend upon you as a servant, as an assistant who is kindly at your service.

source: ཁྱོད་སྲིད་པ་ཐ་མ་པར་གྱུར་པ་ལ་ཡང་བདག་བསྙེན་བཀུར་བྱེད་པར་གྱུར་ཅིག །
en: When you are in your last life, may I be your attendant.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་ཐོབ་ནས་ཀྱང་ཆོས་དང་ལྡན་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཕྱིར་གསོལ་བ་འདེབས་པར་གྱུར་ཅིག །
en: Worthy being, when you have attained enlightenment, may I supplicate you to turn the Dharma wheel that possesses the Dharma teaching.

source: ཁྱོད་ཀྱིས་ཆོས་བསྟན་པ་བདག་གིས་དང་པོར་འབྲས་བུ་དང་བཅས་པར་བྱེད་པར་གྱུར་ཅིག །
en: When you have taught the Dharma, may I be the first to practice it and attain a result.

source: ཆོས་ཀྱི་བཅུད་ཀྱང་འཐུང་བར་གྱུར་ཅིག །
en: May I drink the elixir of the Dharma.

source: འཆི་བ་མེད་པ་ཡང་རྟོགས་པར་གྱུར་ཅིག །
en: May I obtain the medicine of deathlessness.

source: ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པའི་ཕྱིར་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་ཡང་ཐོབ་པར་གྱུར་ཅིག །དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: May I attain arhathood in order to eliminate all kleśas.’ “

source: དེ་ན་ལྷ་དང་། ཀླུ་དང་། ལྷ་མ་ཡིན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གིས་ཀྱང་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེའི་སྤྱོད་པའི་རྗེས་སུ་འཇུག་པའི་ཕྱིར་སྨོན་ལམ་བཏབ་སྟེ་འདུལ་བ་དག་ཀྱང་ཉེ་བར་བཀོད་དོ།
en: In the same way, devas, nāgas, and asuras as numerous as the grains of sand in the Ganges River prayed to become followers of Mahākāruṇika and were established as his disciples. “

source: །དེ་ན་འཚོ་བ་པ་མི་འགྱུར་འཇིགས་བྱེད་ཅེས་བྱ་བ་གཅིག་ཅིག་འདུག་པ་དེས་སྨྲས་པ། ཀྱེ་བྲམ་ཟེ་ཆེན་པོ་བདག་ཀྱང་ཁྱོད་ལ་ཡོ་བྱད་མང་པོ་དག་གིས་གྲོགས་བྱེད་པར་གྱུར་ཅིག །
en: There was an ājīvika named Saṃjñāvikaraṇabhīṣma who said, ‘Dear great brahmin, I will be an assistant who provides much service.

source: བདག་བསྐལ་པ་དཔག་ཏུ་མེད་པ་དག་ཏུ་ཁྱོད་ལ་འབྲས་བུ་དང་བཅས་པར་སྤྱོད་ཅིང་ཉེ་བར་འཚོ་བའི་ཉེ་དུར་གྱུར་ཅིག །རྟག་ཏུ་དངོས་པོ་བསླང་བའི་དོན་དུ་ཁྱོད་ཀྱི་དྲུང་དུ་ཉེ་བར་འགྲོ་བར་གྱུར་ཅིག །མལ་ཆ་དང་། སྟན་དང་། བགོ་བ་དང་། གླང་པོ་ཆེ་དང་། རྟ་དང་། ཤིང་རྟ་དང་།
en: Throughout countless eons may I always be your kinsman who supports your fruitful conduct.

source: གྲོང་དང་།
en: May I always come before you in order to ask for things.

source: གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཁྱིམ་དང་། བུ་དང་། བུ་མོ་དང་། ཤ་དང་། ཁྲག་དང་། པགས་པ་དང་། རུས་པ་དང་། ལག་པ་དང་། རྐང་པ་དང་། ལྕེ་དང་། རྣ་བ་དང་།
en: May I ask you for your bed, your seat, your clothing, your elephant, your horse, your chariot, your village, your town, your city, your family, your son, your daughter, your flesh, your blood, your skin, your bones, your hands, your legs, your tongue, your ears, your nose, your eyes, and your head.

source: སྣ་དང་། མིག་དང་། མགོ་དག་སློང་བར་གྱུར་ཅིག །བྲམ་ཟེ་ཆེན་པོ་བདག་དེ་ལྟར་ཁྱོད་ཀྱི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གྲོགས་སུ་གྱུར་ཅིག །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་གྱི་གྲོགས་སུ་ཡང་གྱུར་ཅིག །
en: Great brahmin, may I thus be an assistant to you in the perfection of generosity, and so on, up to and including an assistant to you in the perfection of wisdom.

source: བྲམ་ཟེ་ཆེན་པོ་བདག་དེ་ལྟར་ཁྱོད་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་གྲོགས་སུ་གྱུར་ཅིག །
en: Great brahmin, may I thus be an assistant to you in the six perfections as you perform bodhisattva conduct.

source: ནམ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་ཐོབ་པ་ན་བདག་ཀྱང་ཁྱོད་ཀྱི་ཉན་ཐོས་ཀྱི་གནས་ཐོབ་པར་གྱུར་ཅིག །
en: When you have attained enlightenment, may I be your disciple.

source: ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་འཛིན་པར་གྱུར་ཅིག །
en: May I learn the 80,000 collections of Dharma teachings.

source: རྗེས་སུ་ཆོས་སྟོན་པར་གྱུར་ཅིག །
en: May I subsequently become one who teaches the Dharma.

source: ཁྱོད་ཀྱིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་གྱུར་ཅིག །
en: And may you give me the prophecy of my attainment of the highest, most complete enlightenment.’ “

source: རིགས་ཀྱི་བུ་བྲམ་ཟེ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པས་དེ་ཐོས་པ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་ནས་འཚོ་བ་མི་འགྱུར་འཇིགས་བྱེད་ལ་བོས་ཏེ་སྨྲས་པ། སྐྱེས་བུ་དམ་པ་ཁྱོད་ངའི་བླ་ན་མེད་པའི་སྤྱོད་པའི་གྲོགས་སུ་འགྱུར་བ་ནི་ལེགས་སོ་ལེགས་སོ།
en: Noble son, the brahmin Mahākāruṇika heard that, and he bowed down the five points of his body to the feet of the Tathāgata Ratnagarbha, called over the ājīvika Saṃjñāvikaraṇabhīṣma, and said to him, ‘Worthy being, it is excellent, excellent that you will be my assistant for unsurpassable conduct.

source: །ཁྱོད་ཚེ་རབས་ཁྲག་ཁྲིག་འབུམ་ཕྲག་ཚད་མེད་གྲངས་མེད་པའི་བར་དུ་ང་ལ་དངོས་པོ་སློང་བའི་ཕྱིར་ན་མ་འོངས་པ་དེའི་ཚེ་ངས་ཀྱང་སེམས་རབ་ཏུ་དང་བས་སྦྱིན་པར་བྱ་སྟེ། ཁྱོད་ལ་ཡང་བསོད་ནམས་མ་ཡིན་པའི་ཆ་དང་འཐུན་པར་མ་གྱུར་ཅིག །
en: For countless, innumerable thousands of trillions of lifetimes, whenever you come to me to ask for something, may I give it to you with a serene mind, and may you never accrue demerit.’ “

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་ཡང་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དེ་དང་དེ་དག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སླད་དུ་སྤྱད་པ་སྤྱོད་པའི་ཚེ། གལ་ཏེ་བདག་གི་མདུན་དུ་སློངས་མོ་པ་གང་དག་མཆིས་ནས་ཟས་སློང་བར་བགྱིད་ཅིང་ཚིག་འཇམ་པོའམ། ཚིག་རྩུབ་པོའམ། བརྙས་པའི་ཚིག་གམ།
en: Noble son, the bodhisattva mahāsattva Mahākāruṇika then said in front of the Tathāgata Ratnagarbha, ‘Bhadanta Bhagavat, during countless, innumerable hundreds of millions of trillions of eons, while I am practicing in order to attain the highest, most complete enlightenment, if a beggar comes before me and asks me for food, whether with pleasant words, harsh words, offensive words, or clear words, Bhadanta Bhagavat, if I become angry with that beggar for even an instant, or if I give through the desire to acquire the results of generosity, then I will have broken my promise to the bhagavat buddhas who reside, live, and remain in countless, innumerable realms in the ten directions, teaching the Dharma—may I then not attain the complete enlightenment of perfect buddhahood.

source: ཚིག་གསལ་བས་སློང་བར་གྱུར་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གིས་སློངས་མོ་པ་ལ་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ཙམ་ཞིག་ཁྲོ་བ་བསྐྱེད་པར་གྱུར་ཏམ། མ་དད་པའི་སེམས་བསྐྱེད་པར་གྱུར་ཏམ། སྦྱིན་པའི་རྣམ་པར་སྨིན་པའི་འབྲས་བུ་འཚལ་བས་སྦྱིན་པ་སྩོལ་བར་གྱུར་ན། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་གཞན་དག་ན་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བདག་གིས་བསླུས་པར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, if I give a gift without a serene mind to a petitioner, the recipient will lose his trust.

source: བདག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མ་གྱུར་ཅིག །བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གིས་སློངས་མོ་པ་ལ་སེམས་མ་དད་པས་སྦྱིན་པ་སྩོལ་ཏམ།
en: May there be no impediment to good qualities.

source: སྦྱིན་པ་དེ་ཡང་ལེན་པ་པོ་ལ་མ་དད་པས་བྱིན་པར་འགྱུར་ཞིང་ཆུད་ཟ་བར་འགྱུར་རམ། གལ་ཏེ་ཐ་ན་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཀྱི་ཚད་ཙམ་ཞིག་དགེ་བའི་ཆོས་རྣམས་ལ་བར་ཆད་བགྱིད་པར་གྱུར་ན་བདག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བསླུས་པར་གྱུར་ཅིག །
en: If there is only a hair tip’s worth of impediment, then I will have broken my promise to the bhagavat buddhas.

source: གལ་ཏེ་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཀྱི་ཚད་ཙམ་ཞིག་ལེན་པ་པོའི་དགེ་བའི་ཆོས་རྣམས་ལ་བར་ཆད་བགྱིད་པར་གྱུར་ན་བདག་ཀྱང་མནར་མེད་པར་མཆི་བར་གྱུར་ཅིག །
en: If there is even a hair tip’s worth of impediment to the recipient’s good qualities, then may I be destined for the Avīci hell. “ ‘

source: ཟས་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་སློངས་མོ་པ་གང་དག་བདག་ལ་གོས་དང་། མགོའི་བར་དག་སློང་བར་འགྱུར་ཞིང་ཚིག་འཇམ་པོའམ། ཚིག་རྩུབ་པོའམ། བརྙས་ཚིག་གམ། ཚིག་གསལ་བས་མགོའི་བར་དག་སློང་བར་བགྱིད་ན།
en: As it is for food, so it is for clothes, and so forth, until those beggars who ask for my head, whether they ask for my head with pleasant words, harsh words, offensive words, or clear words.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གིས་སློངས་མོ་པ་ལ་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ཙམ་ཞིག་ཁྲོ་བའི་སེམས་བསྐྱེད་པར་གྱུར་ཏམ། མ་དད་པའི་སེམས་བསྐྱེད་པར་གྱུར་ཏམ། སྦྱིན་པའི་རྣམ་པར་སྨིན་པའི་འབྲས་བུ་འཚལ་བས། མགོ་བོའི་བར་དག་ཡོངས་སུ་གཏོང་བར་གྱུར་ན། བདག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བསླུས་པར་འགྱུར་བ་ནས།
en: If, Bhadanta Bhagavat, I become angry with that beggar for even an instant of mind, if I give rise to a mind that is not serene, or if I give my head away with the desire for the ripened results of generosity, I will have broken my promise to the bhagavat buddhas, and so may I then become destined for the Avīci hell.

source: བདག་མནར་མེད་པར་མཆི་བའི་བར་དུ་གྱུར་ཅིག །སྦྱིན་པ་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ། ཚུལ་ཁྲིམས་ནས་ཤེས་རབ་ཀྱི་བར་དག་ཡོངས་སུ་གཏོང་བ་ལ་ཡང་བརྗོད་པར་བགྱིའོ།
en: As it is for the abandonment of generosity, so it should be said for the abandonment of good conduct, and so on, up to and including the abandonment of wisdom.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་དེས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ལ་ལེགས་སོ། །ཞེས་བྱ་བ་བྱིན་ཏེ། སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པའི་སེམས་ཀྱིས་སྨོན་ལམ་དེ་ལྟ་བུ་བཏབ་པ་ནི། སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་།
en: Then, noble son, the Tathāgata Ratnagarbha congratulated the bodhisattva mahāsattva Mahākāruṇika: ‘Worthy being, it is excellent, excellent that you, worthy being, have made this prayer with a mind based on great compassion!’ “

source: དྲི་ཟ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཀྱང་ཐལ་མོ་སྦྱར་ཏེ་འཁོད་ནས་དེ་ལ་ལེགས་སོ། །ཞེས་བྱ་བ་བྱིན་ཏེ། སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པའི་ཡིད་ཀྱིས་སྨོན་ལམ་དེ་ལྟ་བུ་བཏབ་པ་ནི་སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ།
en: Noble son, the entire assembly, and the world with its devas, gandharvas, humans, and asuras, placed their palms together and congratulated him: ‘Worthy being, it is excellent, excellent that you, worthy being, have made a prayer with a mind based on great compassion!

source: །ཁྱོད་ནི་སྙིང་པོར་འགྱུར་བ་དང་འཐུན་པའི་ཆོས་དྲུག་གིས་སེམས་ཅན་རྣམས་ཡང་དག་པར་ཚིམ་པར་བྱེད་པར་འགྱུར་རོ།
en: You will bring contentment to beings through the six conducive qualities!’ “

source: །རིགས་ཀྱི་བུ་ཇི་ལྟར་སྦྱིན་པ་ལེན་པའི་བྱང་ཆུབ་སེམས་དཔའ་འཚོ་བ་པ་མི་འགྱུར། འཇིགས་བྱེད་དེས་སྨོན་ལམ་བཏབ་པ་དེ་བཞིན་དུ། སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ཀྱང་སྨོན་ལམ་བཏབ་བོ།
en: Noble son, just as the bodhisattva ājīvika Saṃjñāvikaraṇabhīṣma had prayed to be a recipient of Mahākāruṇika’s generosity, 84,000 other beings made the same prayer. “

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེས་ཇི་ལྟར་འཚོ་བ་པ་མི་འགྱུར་འཇིགས་བྱེད་ཀྱིས་སྨོན་ལམ་བཏབ་པ་དེ་བཞིན་དུ། སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ཀྱང་སྨོན་ལམ་དེ་ལྟ་བུ་དག་བཏབ་པ་ཐོས་པ་དང་།
en: Noble son, the bodhisattva mahāsattva Mahākāruṇika heard the 84,000 beings make the same prayer that the ājīvika Saṃjñāvikaraṇabhīṣma had made.

source: དེ་ནས་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་མཆོག་ཏུ་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་ཐལ་མོ་སྦྱར་ཏེ་འདུག་ནས། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལ་བལྟས་ཏེ་མཆོག་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་སྨྲས་པ། ཨ་ལ་ལ་བདག་ཆོས་ཀྱི་མུ་གེ་དང་། ཟད་པའི་དུས་དང་།
en: Then Mahākāruṇika, with great joy and happiness, placed his palms together and, looking at the entire assembly, said with great joy, ‘Aho!

source: ཉོན་མོངས་པ་ཆེན་པོས་དཀྲུགས་ཤིང་རྩོད་པའི་དུས་ན་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་མགོན་མེད་པའི་དེད་དཔོན་དང་། སྣང་བ་བྱེད་པ་དང་། སྒྲོན་མ་བྱེད་པ་དང་། བྱིས་པ་སྐྱབས་མེད་པ་དང་། ལྡོངས་པ་རྣམས་ཀྱི་ལམ་སྟོན་པར་འགྱུར་བ་དང་། འདི་ལྟར་བདག་གིས་སེམས་དང་པོ་བསྐྱེད་པས་ཚེ་རབས་གཞན་དག་ཏུ་གང་དག་བདག་གི་མགོ་ལེན་པར་འགྱུར་བ་དང་། མིག་དང་། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལག་པ་དང་། རྐང་པ་དང་། པགས་པ་དང་། རུས་པ་དང་།
en: It is wonderful that, at the time when there is a famine of the Dharma—when it has ceased to be, when there is the conflict of great kleśas, in the kaliyuga when the five degeneracies are prevalent, when the world has no guide—that I will be a leader, a maker of light, a lamp, one who shows the way to those who are uncared for, to those who are in the dark, and that, through having developed my aspiration for enlightenment for the first time in this way, I have gained companions in the unsurpassable conduct of enlightenment, who in my future lives will take my head, who will take my eyes, ears, nose, tongue, hands, legs, skin, bones, blood, and so on, up to and including food.’ “

source: ཁྲག་དང་། ཁ་ཟས་ཀྱི་བར་དག་ལེན་པར་འགྱུར་ཞིང་། བླ་ན་མེད་པའི་བྱང་ཆུབ་ཀྱིས་སྤྱོད་པའི་གྲོགས་བྱེད་པ་དེ་ལྟ་བུ་དག་རྙེད་པ་ནི་ངོ་མཚར་ཏོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་འདུག་སྟེ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཚེ་རབས་གཞན་གྱི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དེ་དང་དེ་དག་ནས་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་པའི་བར་དུ་བདག་གི་དྲུང་དུ་སློངས་མོ་པ་གང་དག་ཉེ་བར་མཆི་བར་འགྱུར་ཞིང་ཡུན་རིང་པོ་དེ་སྲིད་ཀྱི་བར་དུ་ཟས་སམ།
en: Noble son, the bodhisattva mahāsattva Mahākāruṇika sat before the Tathāgata Ratnagarbha and said, ‘Bhadanta Bhagavat, in my future lives, during countless, innumerable trillions of eons, until I reach enlightenment, during that time, whenever someone comes before me asking either for food or for drink, and so on, up to and including my head, may they receive it.

source: སྐོམ་དག་བླངས་པར་གྱུར་པ་དང་། བདག་གིས་སུག་པ་ནས་ཐ་ན་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཀྱི་ཚད་ཙམ་གྱི་སྦྱིན་པ་བླངས་པར་གྱུར་པའི་སེམས་ཅན་དེ་དག་བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: Even if it is only as much as a hair tip’s worth, may they receive it from my hand, until enlightenment.

source: གལ་ཏེ་འཁོར་བ་ལས་ཡོངས་སུ་ཐར་བར་མི་བགྱིད་དམ། ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། ཐེག་པ་ཆེན་པོས་ལུང་སྟོན་པར་མི་བགྱིད་ན། བདག་གིས་གང་དག་ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བཞུགས་ཏེ།
en: And if, Bhadanta Bhagavat, after having attained the highest, most complete enlightenment, I do not liberate those beings from saṃsāra, or I do not give them prophecies through the Śrāvakayāna, the Pratyekabuddhayāna, or the Mahāyāna, then I will have broken my promise to the bhagavat buddhas who now reside, live, and remain, teaching the Dharma, in the realms in the ten directions.

source: འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བསླུས་པར་འགྱུར་བ་ནས་བདག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་འགྱུར་བའི་བར་དུ་གྱུར་ཅིག །
en: May I then not attain the complete enlightenment of unsurpassable, perfect buddhahood.’ “
